package lesson_13.code.lessoncode;

public class UseArrayForWorkWithMethods {
    public static void main(String[] args) {
        /*
        1) Создать массив той длины, которую введет пользователь
        2) наполнить массив данными, которые введет пользователь
        3) посчитать сумму всех элементов массива
        4) найти максимальное значение среди элементов массива


        для п1:

        - создать Сканер (или использовать наш класс UserInput)
        - запросить у пользователя длину массива
        - создать массив нужной длины

        для п2:
        в цикле по длине массива для каждого элемента массива нужно
        запросить у пользователя данные и сохранить то что он ввел
        в соответсвующей ячейке массива

        для п3:

        для п4:




         */

    }
}
