package lesson_12.code.lessoncode;

public class PracticeTask3 {
    /*

  Задание 1. У вас есть текст


   Требуется:

   убрать все специальные символы, такие "(", ")", "@"
   (методом replaceAll не пользоваться)

  Задание 2.
  Напишите программу, которая запрашивает у пользователя несколько чисел
  при вводе 0 - печатает сумму всех введенных чисел и их среднее арифметическое значение


Задание 3.
Написать метод для вычисления факториала числа (произведение всех чисел от 1 до заданного)


     */
}
